apache/nuttx/arch/xtensa/src/esp32/esp32_espnow_pktradio.c
/****************************************************************************
 * arch/xtensa/src/esp32/esp32_espnow_pktradio.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <assert.h>
#include <debug.h>

#include <arpa/inet.h>
#include <net/if.h>

#include <nuttx/wqueue.h>
#include <nuttx/mm/iob.h>
#include <nuttx/net/net.h>
#include <nuttx/net/ip.h>
#include <nuttx/spinlock.h>
#include <nuttx/net/radiodev.h>
#include <nuttx/net/sixlowpan.h>
#include <nuttx/wireless/pktradio.h>
#include <nuttx/wdog.h>

#include "xtensa.h"
#include "xtensa_attr.h"
#include "esp_now.h"
#include "esp_mac.h"
#include "esp32_espnow_pktradio.h"

#ifdef CONFIG_ESP32_ESPNOW_PKTRADIO

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* TX timeout = 1 minute */

#define ESP32_ESPNOW_TXTOUT (60 * CLK_TCK)

/* We need to have the work queue */

#if !defined(CONFIG_SCHED_WORKQUEUE)
#  error Worker thread support is required (CONFIG_SCHED_WORKQUEUE)
#else
#  if defined(CONFIG_SCHED_LPWORK)
#    define LPBKWORK LPWORK
#  elif defined(CONFIG_SCHED_HPWORK)
#    define LPBKWORK HPWORK
#  else
#    error Neither CONFIG_SCHED_LPWORK nor CONFIG_SCHED_HPWORK defined
#  endif
#endif

#ifndef CONFIG_WIRELESS_PKTRADIO
#  error CONFIG_WIRELESS_PKTRADIO=y is required.
#endif

#ifndef CONFIG_NET_6LOWPAN
#  error CONFIG_NET_6LOWPAN=y is required.
#endif

#if (CONFIG_PKTRADIO_ADDRLEN != 1) && (CONFIG_PKTRADIO_ADDRLEN != 2) && \
    (CONFIG_PKTRADIO_ADDRLEN != 8)
#  error No support for CONFIG_PKTRADIO_ADDRLEN other than {1, 2 or 8}
#endif

/****************************************************************************
 * MAC HDR: 3 byte MAGIC, 2 byte PANID, 1 byte INFO, SRC addr, DST addr
 * INFO: BIT0-1: address size: 00 (2^0) -> 1 BYTE address size
 *                             01 (2^1) -> 2 BYTE address size
 *                             11 (2^3) -> 8 BYTE address size
 * Future expansion: INFO BIT2: cypher info added to MAC HDR
 *
 ****************************************************************************/

#define MAC_MAGIC        "6lo"
#define MAC_PANIDOFFSET  sizeof(MAC_MAGIC) - 1
#define MAC_PANIDLEN     2
#define MAC_INFOOFFSET   MAC_PANIDOFFSET + MAC_PANIDLEN
#define MAC_INFOLEN      1
#define MAC_ADDRLEN      CONFIG_PKTRADIO_ADDRLEN
#define MAC_SRCOFFSET    MAC_INFOOFFSET + MAC_INFOLEN
#define MAC_DSTOFFSET    MAC_SRCOFFSET + MAC_ADDRLEN
#define MAC_HDRSIZE      MAC_DSTOFFSET + MAC_ADDRLEN
#if MAC_ADDRLEN == 1
#define MAC_INFOADDRLEN  0x0
#elif MAC_ADDRLEN == 2
#define MAC_INFOADDRLEN  0x1
#elif MAC_ADDRLEN == 8
#define MAC_INFOADDRLEN  0x3
#endif
#define MAC_INFOADDRMASK 0x3

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * The espnow_driver_s encapsulates all state information for a single
 * hardware interface
 *
 ****************************************************************************/

struct espnow_driver_s
{
  bool bifup; /* true:ifup false:ifdown */

  uint8_t mac_address[MAC_ADDRLEN]; /* node address */
  uint8_t panid[MAC_PANIDLEN];      /* network id */

  struct sixlowpan_reassbuf_s iobuffer; /* buffer for packet reassembly */

  FAR struct iob_s *rxhead; /* Head of IOBs queued for rx */
  FAR struct iob_s *rxtail; /* Tail of IOBs queued for rx */
  FAR struct iob_s *txhead; /* Head of IOBs queued for tx */
  FAR struct iob_s *txtail; /* Tail of IOBs queued for tx */

  bool txblocked;           /* Indicates a blocked/failed tx */

  struct wdog_s txtimeout;  /* TX timeout timer */

  struct work_s work;       /* Defer tx and rx work to the work queue */
  struct work_s pollwork;   /* Defer pollwork to the work queue */
  struct work_s toutwork;   /* Defer driver reset to the work queue */

  spinlock_t lock;          /* Device specific lock */

  struct radio_driver_s radio;  /* Interface understood by the network */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct espnow_driver_s g_espnow;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Utility functions */

static void espnow_addr(FAR struct net_driver_s *dev);
static void espnow_addr2ip(FAR struct net_driver_s *dev);
static inline void espnow_netmask(FAR struct net_driver_s *dev);

/* Queue functions */

static void espnow_txtailadd(FAR struct espnow_driver_s *priv,
                             FAR struct iob_s *iob);
static void espnow_txheadadd(FAR struct espnow_driver_s *priv,
                             FAR struct iob_s *iob);
static FAR struct iob_s *espnow_txtailget(FAR struct espnow_driver_s *priv);
static void espnow_rxtailadd(FAR struct espnow_driver_s *priv,
                             FAR struct iob_s *iob);
static FAR struct iob_s *espnow_rxtailget(FAR struct espnow_driver_s *priv);

/* ESPNOW low level routines */

