apache/nuttx/arch/xtensa/src/esp32/esp32_espnow_pktradio.c
static int espnow_error_to_errno(esp_err_t err);
static int espnow_send(FAR struct iob_s *iob);
static void espnow_recv_cb(const esp_now_recv_info_t * esp_now_info,
                           const uint8_t *data, int data_len);

/* Translate pktmeta to MAC header and vice versa */

static void espnow_add_header(struct espnow_driver_s *espnow,
                              FAR struct pktradio_metadata_s *pktmeta,
                              FAR struct iob_s *iob);
static void espnow_extract_pktmeta(FAR struct iob_s *iob,
                                   FAR struct pktradio_metadata_s *pktmeta);

/* TX and RX work */

static void espnow_work(FAR void *arg);

/* TX polling logic */

static void espnow_txavail_work(FAR void *arg);
static int  espnow_txpoll_callback(FAR struct net_driver_s *dev);

/* Watchdog timer expirations */

static void espnow_txtimeout_work(void *arg);
static void espnow_txtimeout_expiry(wdparm_t arg);

/* NuttX callback functions */

static int  espnow_ifup(FAR struct net_driver_s *dev);
static int  espnow_ifdown(FAR struct net_driver_s *dev);
static int  espnow_txavail(FAR struct net_driver_s *dev);
#ifdef CONFIG_NET_MCASTGROUP
static int  espnow_addmac(FAR struct net_driver_s *dev,
                          FAR const uint8_t *mac);
static int  espnow_rmmac(FAR struct net_driver_s *dev,
                         FAR const uint8_t *mac);
#endif
#ifdef CONFIG_NETDEV_IOCTL
static int  espnow_ioctl(FAR struct net_driver_s *dev, int cmd,
              unsigned long arg);
#endif
static int espnow_get_mhrlen(FAR struct radio_driver_s *netdev,
              FAR const void *meta);
static int espnow_req_data(FAR struct radio_driver_s *netdev,
              FAR const void *meta, FAR struct iob_s *framelist);
static int espnow_properties(FAR struct radio_driver_s *netdev,
              FAR struct radiodev_properties_s *properties);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: espnow_addr
 *
 * Description:
 *   Set the address based on config values.
 *
 ****************************************************************************/

static void espnow_addr(FAR struct net_driver_s *dev)
{
  FAR struct espnow_driver_s *priv =
    (FAR struct espnow_driver_s *)dev->d_private;

#if CONFIG_PKTRADIO_ADDRLEN == 1
  /* Set the mac address based on the 1 byte address */

  priv->mac_address[0] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_0;

#elif CONFIG_PKTRADIO_ADDRLEN == 2
  /* Set the mac address based on the 2 byte address */

  priv->mac_address[0] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_0;
  priv->mac_address[1] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_1;

#elif CONFIG_PKTRADIO_ADDRLEN == 8
  /* Set the mac address based on the 8 byte address */

  priv->mac_address[0] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_0;
  priv->mac_address[1] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_1;
  priv->mac_address[2] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_2;
  priv->mac_address[3] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_3;
  priv->mac_address[4] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_4;
  priv->mac_address[5] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_5;
  priv->mac_address[6] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_6;
  priv->mac_address[7] = CONFIG_ESP32_ESPNOW_PKTRADIO_NODE_ADDR_7;

#endif
}

/****************************************************************************
 * Name: espnow_addr2ip
 *
 * Description:
 *   Create a MAC-based IP address from the pktradio address assigned to the
 *   node.
 *
 *  128  112  96   80    64   48   32   16
 * ---- ---- ---- ---- ---- ---- ---- ----
 * fe80 0000 0000 0000 0000 00ff fe00 00xx 1-byte pktradio address
 * fe80 0000 0000 0000 0000 00ff fe00 xxxx 2-byte pktradio address
 * fe80 0000 0000 0000 xxxx xxxx xxxx xxxx 8-byte pktradio address
 *
 ****************************************************************************/

static void espnow_addr2ip(FAR struct net_driver_s *dev)
{
  FAR struct espnow_driver_s *priv =
    (FAR struct espnow_driver_s *)dev->d_private;
  uint8_t mac_addr[MAC_ADDRLEN];

  /* Copy the MAC address */

  memcpy(mac_addr, priv->mac_address, MAC_ADDRLEN);

  /* Set the MAC address as the saddr */

  dev->d_mac.radio.nv_addrlen = MAC_ADDRLEN;
  memcpy(dev->d_mac.radio.nv_addr, mac_addr, MAC_ADDRLEN);

  /* Set the IP address */

  dev->d_ipv6addr[0]  = HTONS(0xfe80);
  dev->d_ipv6addr[1]  = 0;
  dev->d_ipv6addr[2]  = 0;
  dev->d_ipv6addr[3]  = 0;

#if CONFIG_PKTRADIO_ADDRLEN == 1
  /* Set the IP address based on the 1 byte address */

  dev->d_ipv6addr[4]  = 0;
  dev->d_ipv6addr[5]  = HTONS(0x00ff);
  dev->d_ipv6addr[6]  = HTONS(0xfe00);
  dev->d_ipv6addr[7]  = (uint16_t)mac_addr[0] << 8;

#elif CONFIG_PKTRADIO_ADDRLEN == 2
  /* Set the IP address based on the 2 byte address */

  dev->d_ipv6addr[4]  = 0;
  dev->d_ipv6addr[5]  = HTONS(0x00ff);
  dev->d_ipv6addr[6]  = HTONS(0xfe00);
  dev->d_ipv6addr[7]  = (uint16_t)mac_addr[0] << 8 |
                        (uint16_t)mac_addr[1];

#elif CONFIG_PKTRADIO_ADDRLEN == 8
  /* Set the IP address based on the 8-byte address */

  dev->d_ipv6addr[4]  = (uint16_t)mac_addr[0] << 8 |
                        (uint16_t)mac_addr[1];
  dev->d_ipv6addr[5]  = (uint16_t)mac_addr[2] << 8 |
                        (uint16_t)mac_addr[3];
  dev->d_ipv6addr[6]  = (uint16_t)mac_addr[4] << 8 |
                        (uint16_t)mac_addr[5];
  dev->d_ipv6addr[7]  = (uint16_t)mac_addr[6] << 8 |
                        (uint16_t)mac_addr[7];

#endif
}

/****************************************************************************
 * Name: espnow_netmask
 *
 * Description:
 *   Create a netmask of a MAC-based IP address for pktradio address.
 *
 *  128  112   96   80   64   48   32   16
 * ---- ---- ---- ---- ---- ---- ---- ----
 * ffff ffff ffff ffff ffff ffff ffff ff00 1-byte pktradio address
 * ffff ffff ffff ffff ffff ffff ffff 0000 2-byte pktradio address
 * ffff ffff ffff ffff 0000 0000 0000 0000 8-byte pktradio address
 *
 ****************************************************************************/

static inline void espnow_netmask(FAR struct net_driver_s *dev)
{
  dev->d_ipv6netmask[0]  = 0xffff;
  dev->d_ipv6netmask[1]  = 0xffff;
  dev->d_ipv6netmask[2]  = 0xffff;
  dev->d_ipv6netmask[3]  = 0xffff;

#if CONFIG_PKTRADIO_ADDRLEN == 1
  dev->d_ipv6netmask[4]  = 0xffff;
  dev->d_ipv6netmask[5]  = 0xffff;
  dev->d_ipv6netmask[6]  = 0xffff;
  dev->d_ipv6netmask[7]  = HTONS(0xff00);

#elif CONFIG_PKTRADIO_ADDRLEN == 2
  dev->d_ipv6netmask[4]  = 0xffff;
  dev->d_ipv6netmask[5]  = 0xffff;
  dev->d_ipv6netmask[6]  = 0xffff;
  dev->d_ipv6netmask[7]  = 0;

#elif CONFIG_PKTRADIO_ADDRLEN == 8
  dev->d_ipv6netmask[4]  = 0;
  dev->d_ipv6netmask[5]  = 0;
  dev->d_ipv6netmask[6]  = 0;
  dev->d_ipv6netmask[7]  = 0;
#endif
}

/****************************************************************************
 * Name: espnow_add_header
 *
 * Description
 *   Create and add the mac header to iob for TX
 *
 * Input Parameters:
 *   priv    - Reference to the driver state structure
 *   pktmeta - pktmeta
 *   iob     - iob to add the header to
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void espnow_add_header(struct espnow_driver_s *priv,
                              FAR struct pktradio_metadata_s *pktmeta,
                              FAR struct iob_s *iob)
{
  uint8_t info = MAC_INFOADDRLEN;

  memcpy(&iob->io_data[0], MAC_MAGIC, sizeof(MAC_MAGIC) - 1);
  memcpy(&iob->io_data[MAC_PANIDOFFSET], priv->panid, MAC_PANIDLEN);
  memcpy(&iob->io_data[MAC_INFOOFFSET], &info, sizeof(info));
  memcpy(&iob->io_data[MAC_SRCOFFSET], pktmeta->pm_src.pa_addr, MAC_ADDRLEN);
  memcpy(&iob->io_data[MAC_DSTOFFSET], pktmeta->pm_dest.pa_addr,
         MAC_ADDRLEN);
}

/****************************************************************************
 * Name: espnow_extract_pktmeta
 *
 * Description
 *   Extract pktmeta from received iob
 *
 * Input Parameters:
 *   iob     - iob to extract pktmeta from
 *   pktmeta - pktmeta to update
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void espnow_extract_pktmeta(FAR struct iob_s *iob,
                                   FAR struct pktradio_metadata_s *pktmeta)
{
  pktmeta->pm_src.pa_addrlen = MAC_ADDRLEN;
  pktmeta->pm_dest.pa_addrlen = MAC_ADDRLEN;

  memcpy(pktmeta->pm_src.pa_addr, &iob->io_data[MAC_SRCOFFSET], MAC_ADDRLEN);
  memcpy(pktmeta->pm_dest.pa_addr, &iob->io_data[MAC_DSTOFFSET],
         MAC_ADDRLEN);
  iob->io_offset = MAC_HDRSIZE;
}

/****************************************************************************
 * Name: espnow_txtailadd
 *
 * Description
 *   Add a iob to txtail
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *   iob  - iob to add
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

