apache/nuttx/arch/xtensa/src/esp32/esp32_espnow_pktradio.c
static void espnow_txtailadd(FAR struct espnow_driver_s *priv,
                             FAR struct iob_s *iob)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  if (priv->txhead == NULL)
    {
      /* Add iob to empty list */

      priv->txhead = iob;
    }
  else
    {
      /* Update tx tail io_flink */

      priv->txtail->io_flink = iob;
    }

  /* Add iob to list */

  priv->txtail = iob;

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: espnow_txheadadd
 *
 * Description
 *   Add a iob to txhead
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *   iob  - iob to add
 *
 * Returned Value:
 *   None
 ****************************************************************************/

static void espnow_txheadadd(FAR struct espnow_driver_s *priv,
                             FAR struct iob_s *iob)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  if (priv->txhead == NULL)
    {
      /* add iob to empty list */

      priv->txhead = iob;
      priv->txtail = iob;
    }
  else
    {
      /* update iob->io_flink and txhead */

      iob->io_flink = priv->txhead;
      priv->txhead = iob;
    }

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: espnow_txtailget
 *
 * Description
 *   Remove the iob from txhead
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   iob pointer
 *
 ****************************************************************************/

static FAR struct iob_s *espnow_txtailget(FAR struct espnow_driver_s *priv)
{
  FAR struct iob_s *iob;
  irqstate_t flags;

  if (priv->txhead == NULL)
    {
      return NULL;
    }

  flags = spin_lock_irqsave(&priv->lock);

  /* Remove the IOB from the tx list */

  iob = priv->txhead;
  priv->txhead = iob->io_flink;
  iob->io_flink = NULL;

  /* Did the tx list become empty? */

  if (priv->txhead == NULL)
    {
          priv->txtail = NULL;
    }

  spin_unlock_irqrestore(&priv->lock, flags);

  return iob;
}

/****************************************************************************
 * Name: espnow_rxtailadd
 *
 * Description
 *   Add a iob to rxtail
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *   iob  - iob to add
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void espnow_rxtailadd(FAR struct espnow_driver_s *priv,
                             FAR struct iob_s *iob)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  if (priv->rxhead == NULL)
    {
      /* Add iob to rx list */

      priv->rxhead = iob;
    }
  else
    {
      /* Update rx tail io_flink */

      priv->rxtail->io_flink = iob;
    }

  /* Add iob to rxtail */

  priv->rxtail = iob;

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: espnow_rxtailget
 *
 * Description
 *   Remove the iob from txhead
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   iob
 *
 ****************************************************************************/

static FAR struct iob_s *espnow_rxtailget(FAR struct espnow_driver_s *priv)
{
  FAR struct iob_s *iob;
  irqstate_t flags;

  if (priv->rxhead == NULL)
    {
      return NULL;
    }

  flags = spin_lock_irqsave(&priv->lock);

  /* Remove the IOB from the tx queue */

  iob = priv->rxhead;
  priv->rxhead = iob->io_flink;
  iob->io_flink = NULL;

  /* Did the framelist become empty? */

  if (priv->rxhead == NULL)
    {
          priv->rxtail = NULL;
    }

  spin_unlock_irqrestore(&priv->lock, flags);

  return iob;
}

/****************************************************************************
 * Name: espnow_error_to_nuttx
 *
 * Description:
 *   Translate espnow_error to nuttx
 *
 * Input Parameters:
 *   err - espnow error
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

static int espnow_error_to_errno(esp_err_t err)
{
  int ret;

  switch (err)
    {
      case ESP_OK:
        ret = OK;
        break;
      case ESP_ERR_ESPNOW_NOT_INIT:
      case ESP_ERR_ESPNOW_INTERNAL:
        ret = -EIO;
        break;
      case ESP_ERR_ESPNOW_ARG:
        ret = -EINVAL;
        break;
      case ESP_ERR_ESPNOW_NO_MEM:
        ret = -ENOMEM;
        break;
      case ESP_ERR_ESPNOW_NOT_FOUND:
      case ESP_ERR_ESPNOW_IF:
        ret = -ENOSYS;
        break;
      default:
        ret = ERROR;
        break;
    }

  if (ret != OK)
    {
      wlerr("ERROR: %d\n", ret);
    }

  return ret;
}

/****************************************************************************
 * Name: espnow_send
 *
 * Description:
 *   Broadcast a frame over espnow
 *
 * Input Parameters:
 *   iob - iob to send
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

static int espnow_send(FAR struct iob_s *iob)
{
  const uint8_t broadcast[] =
    {
      0xff, 0xff, 0xff, 0xff, 0xff, 0xff
    };

  esp_err_t err;

  err = esp_now_send(broadcast, iob->io_data, iob->io_len);
  return espnow_error_to_errno(err);
}

/****************************************************************************
 * Name: espnow_recv_cb
 *
 * Description:
 *   Callback when data is received over espnow, allocate a new iob, copy the
 *   received data and add the iob to the rx queue.
 *
 * Input Parameters:
 *   esp_now_info - info of the broadcasting node (unused),
 *   data         - received data
 *   len          - received data size
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

