apache/nuttx/arch/xtensa/src/esp32/esp32_espnow_pktradio.c
static void espnow_recv_cb(const esp_now_recv_info_t * esp_now_info,
                           const uint8_t *data, int data_len)
{
  FAR struct espnow_driver_s *priv = &g_espnow;
  FAR struct iob_s *iob;
  uint8_t info;
  irqstate_t flags;

  /* Drop received data if interface not up */

  if (!priv->bifup)
    {
      return;
    }

  /* Drop received data if header is too small */

  if (data_len < (MAC_DSTOFFSET + MAC_ADDRLEN))
    {
      return;
    }

  /* Drop received data if header does not start with magic */

  if (memcmp(data, MAC_MAGIC, sizeof(MAC_MAGIC) - 1))
    {
      return;
    }

  /* Drop received data if header PANID is not ours
   * todo: add support for multiple PANID's
   */

  if (memcmp(&data[MAC_PANIDOFFSET], priv->panid, MAC_PANIDLEN))
    {
      return;
    }

  /* Drop received data if different address length is used */

  memcpy(&info, &data[MAC_INFOOFFSET], 1);

  if ((info & MAC_INFOADDRMASK) != MAC_INFOADDRLEN)
    {
      return;
    }

  /* Header data seems ok, continue with processing */

  iob = iob_tryalloc(false);

  /* Ignore the packet if allocation fails or packet too large */

  if ((iob == NULL) || (data_len > CONFIG_IOB_BUFSIZE))
    {
      return;
    }

  /* Copy the data to the iob */

  memcpy(iob->io_data, data, data_len);
  iob->io_len = data_len;

  /* Add the iob to the rx queue */

  espnow_rxtailadd(priv, iob);

  /* Schedule work to queue */

  if (work_available(&priv->work))
    {
      work_queue(LPBKWORK, &priv->work, espnow_work, priv, 0);
    }
}

/****************************************************************************
 * Name: espnow_send_cb
 *
 * Description:
 *   Callback after data is send over espnow, just cancel the watchdog.
 *
 * Input Parameters:
 *   mac_address - The mac address of the destination node,
 *   status      - The send result
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void espnow_send_cb(const uint8_t *mac_address,
                           esp_now_send_status_t status)
{
  FAR struct espnow_driver_s *priv = &g_espnow;

  wd_cancel(&priv->txtimeout);

  /* If TX has been blocked reschedule espnow_work */

  if (priv->txblocked)
    {
      priv->txblocked = false;

      /* Schedule the work on the worker thread. */

      if (work_available(&priv->work))
        {
          work_queue(LPBKWORK, &priv->work, espnow_work, priv, 0);
        }
    }
}

/****************************************************************************
 * Name: espnow_transmit
 *
 * Description:
 *   Try to send all TX packets. If this fails break the loop and schedule
 *   return to the transmit.
 *
 * Input Parameters:
 *   priv - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void espnow_transmit(FAR struct espnow_driver_s *priv)
{
  FAR struct iob_s *iob;
  int ret;

  while ((iob = espnow_txtailget(priv)))
    {
      ret = espnow_send(iob);

      /* Increment statistics */

      NETDEV_TXPACKETS(&priv->radio.r_dev);

      if (ret < 0)
        {
          nerr("ERROR: espnow_send returned %d\n", ret);
          NETDEV_TXERRORS(&priv->radio.r_dev);
          NETDEV_ERRORS(&priv->radio.r_dev);
        }

      /* Reschedule on failure */

      if (ret == -ENOMEM)
        {
          espnow_txheadadd(priv, iob);
          wd_start(&priv->txtimeout, ESP32_ESPNOW_TXTOUT,
                   espnow_txtimeout_expiry, (uint32_t)priv);
          priv->txblocked = true;
          break;
        }
      else
        {
          iob_free(iob);
        }
    }
}

/****************************************************************************
 * Name: espnow_work
 *
 * Description:
 *   Call espnow_transmit to send available packets to espnow, process
 *   received packets from espnow and call espnow_transmit again
 *   to send responses.
 *
 * Input Parameters:
 * priv - Reference to the driver state structure
 *
 *
 ****************************************************************************/

static void espnow_work(void *arg)
{
  FAR struct espnow_driver_s *priv = (FAR struct espnow_driver_s *)arg;
  struct pktradio_metadata_s pktmeta;
  FAR struct iob_s *iob;
  int ret;

  /* Send available packets */

  espnow_transmit(priv);

  /* Loop while there are frames to be processed, send them to sixlowpan */

  net_lock();

  while ((iob = espnow_rxtailget(priv)))
    {
      /* Make sure the our single packet buffer is attached */

      priv->radio.r_dev.d_buf = priv->iobuffer.rb_buf;

      /* Return the next frame to the network */

      ninfo("Send frame %p to the network:  Offset=%u Length=%u\n",
            iob, iob->io_offset, iob->io_len);

      memset(&pktmeta, 0, sizeof(struct pktradio_metadata_s));

      espnow_extract_pktmeta(iob, &pktmeta);

      ret = sixlowpan_input(&priv->radio, iob, (FAR void *)&pktmeta);

      /* Increment statistics */

      NETDEV_TXPACKETS(&priv->radio.r_dev);

      if (ret < 0)
        {
          nerr("ERROR: sixlowpan_input returned %d\n", ret);
          NETDEV_RXERRORS(&priv->espnow_radio.r_dev);
          NETDEV_ERRORS(&priv->espnow_radio.r_dev);
        }
    }

  /* Send response packets */

  espnow_transmit(priv);

  net_unlock();
}

/****************************************************************************
 * Function: espnow_txtimeout_work
 *
 * Description:
 *   Perform TX timeout related work (reset) from the worker thread
 *
 * Input Parameters:
 *   arg - The argument passed when work_queue() as called.
 *
 * Returned Value:
 *   OK on success
 *
 ****************************************************************************/

static void espnow_txtimeout_work(void *arg)
{
  struct espnow_driver_s *priv = (struct espnow_driver_s *)arg;

  net_lock();

  espnow_ifdown(&priv->radio.r_dev);
  espnow_ifup(&priv->radio.r_dev);

  net_unlock();
}

/****************************************************************************
 * Function: espnow_txtimeout_expiry
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer callback handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Input Parameters:
 *   argc - The number of available arguments
 *   arg  - The first argument
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

