apache/nuttx/arch/xtensa/src/esp32/esp32_espnow_pktradio.c
static void espnow_txtimeout_expiry(wdparm_t arg)
{
  struct espnow_driver_s *priv = (struct espnow_driver_s *)arg;

  /* Schedule to perform the TX timeout processing on the worker thread. */

  if (work_available(&priv->toutwork))
    {
      work_queue(LPBKWORK, &priv->toutwork, espnow_txtimeout_work, priv, 0);
    }
}

/****************************************************************************
 * Name: espnow_txpoll_callback
 *
 * Description:
 *   The transmitter is available, check if the network has any outgoing
 *   packets ready to send.  This is a callback from devif_poll().
 *   devif_poll() may be called:
 *
 *   1. When the preceding TX packet send is complete,
 *   2. When the preceding TX packet send timesout and the interface is reset
 *   3. During normal TX polling
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   The network is locked.
 *
 ****************************************************************************/

static int espnow_txpoll_callback(FAR struct net_driver_s *dev)
{
  /* If zero is returned, the polling will continue until all connections
   * have been examined.
   */

  return 0;
}

/****************************************************************************
 * Name: espnow_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int espnow_ifup(FAR struct net_driver_s *dev)
{
  FAR struct espnow_driver_s *priv =
    (FAR struct espnow_driver_s *)dev->d_private;
  FAR struct iob_s *iob;
  esp_now_peer_info_t broadcast =
    {
      .peer_addr =
        {
          0xff, 0xff, 0xff, 0xff, 0xff, 0xff
        },

      .channel = 0,
      .encrypt = false,
    };

  /* Free all RX iobs */

  while ((iob = espnow_rxtailget(priv)))
    {
      iob_free(iob);
    }

  if (esp_now_init() != ESP_OK)
    {
      return -ENOSYS;
    }

  if (esp_now_add_peer(&broadcast) != ESP_OK)
    {
      return -ENOSYS;
    }

  if (esp_now_register_recv_cb(espnow_recv_cb) != ESP_OK)
    {
      return -ENOSYS;
    }

  if (esp_now_register_send_cb(espnow_send_cb) != ESP_OK)
    {
      return -ENOSYS;
    }

  ninfo("Bringing up: IPv6 %04x:%04x:%04x:%04x:%04x:%04x:%04x:%04x\n",
        dev->d_ipv6addr[0], dev->d_ipv6addr[1], dev->d_ipv6addr[2],
        dev->d_ipv6addr[3], dev->d_ipv6addr[4], dev->d_ipv6addr[5],
        dev->d_ipv6addr[6], dev->d_ipv6addr[7]);

#if CONFIG_PKTRADIO_ADDRLEN == 1
  ninfo("Node: %02x\n",
         dev->d_mac.radio.nv_addr[0]);

#elif CONFIG_PKTRADIO_ADDRLEN == 2
  ninfo("Node: %02x:%02x\n",
         dev->d_mac.radio.nv_addr[0], dev->d_mac.radio.nv_addr[1]);

#elif CONFIG_PKTRADIO_ADDRLEN == 8
  ninfo("Node: %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x PANID=%02x:%02x\n",
         dev->d_mac.radio.nv_addr[0], dev->d_mac.radio.nv_addr[1],
         dev->d_mac.radio.nv_addr[2], dev->d_mac.radio.nv_addr[3],
         dev->d_mac.radio.nv_addr[4], dev->d_mac.radio.nv_addr[5],
         dev->d_mac.radio.nv_addr[6], dev->d_mac.radio.nv_addr[7]);
#endif

  priv->txblocked = false;
  priv->bifup = true;
  return OK;
}

/****************************************************************************
 * Name: espnow_ifdown
 *
 * Description:
 *   NuttX Callback: Stop the interface.
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int espnow_ifdown(FAR struct net_driver_s *dev)
{
  FAR struct espnow_driver_s *priv =
    (FAR struct espnow_driver_s *)dev->d_private;
  FAR struct iob_s *iob;
  const uint8_t broadcast[] =
    {
      0xff, 0xff, 0xff, 0xff, 0xff, 0xff
    };

  ninfo("IP up: %u\n", priv->bifup);

  /* Free all TX iobs */

  while ((iob = espnow_txtailget(priv)))
    {
      iob_free(iob);
    }

  (void)esp_now_del_peer(broadcast);

  (void)esp_now_unregister_recv_cb();

  (void)esp_now_unregister_send_cb();

  (void)esp_now_deinit();

  /* Mark the device "down" */

  priv->bifup = false;

  return OK;
}

/****************************************************************************
 * Name: espnow_txavail_work
 *
 * Description:
 *   Perform an out-of-cycle poll on the worker thread.
 *
 * Input Parameters:
 *   arg - Reference to the NuttX driver state structure (cast to void*)
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called on the higher priority worker thread.
 *
 ****************************************************************************/

static void espnow_txavail_work(FAR void *arg)
{
  FAR struct espnow_driver_s *priv = (FAR struct espnow_driver_s *)arg;

  ninfo("TX available work. IP up: %u\n", priv->bifup);

  net_lock();

  /* Ignore the notification if the interface is not yet up */

  if (priv->bifup)
    {
      /* If so, then poll the network for new XMIT data */

#ifdef CONFIG_NET_6LOWPAN
      /* Make sure the our single packet buffer is attached */

      priv->radio.r_dev.d_buf = priv->iobuffer.rb_buf;
#endif

      /* Then perform the poll */

      devif_poll(&priv->radio.r_dev, espnow_txpoll_callback);
    }

  net_unlock();
}

/****************************************************************************
 * Name: espnow_txavail
 *
 * Description:
 *   Driver callback invoked when new TX data is available.  This is a
 *   stimulus perform an out-of-cycle poll and, thereby, reduce the TX
 *   latency.
 *
 * Input Parameters:
 *   dev - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called in normal user mode
 *
 ****************************************************************************/

static int espnow_txavail(FAR struct net_driver_s *dev)
{
  FAR struct espnow_driver_s *priv = (FAR struct espnow_driver_s *)
                                     dev->d_private;

  ninfo("Available: %u\n", work_available(&priv->pollwork));

  /* Is our single work structure available?  It may not be if there are
   * pending actions and we will have to ignore the Tx availability
   * action.
   */

