apache/nuttx/arch/xtensa/src/esp32/esp32_espnow_pktradio.c
static int espnow_req_data(FAR struct radio_driver_s *netdev,
                           FAR const void *meta, FAR struct iob_s *framelist)
{
  FAR struct espnow_driver_s *priv;
  FAR struct iob_s *iob;
  struct pktradio_metadata_s *pktmeta = (struct pktradio_metadata_s *)meta;
  uint8_t mac[CONFIG_PKTRADIO_ADDRLEN];

  DEBUGASSERT(netdev != NULL && netdev->r_dev.d_private != NULL);
  priv = (FAR struct espnow_driver_s *)netdev->r_dev.d_private;

  DEBUGASSERT(meta != NULL && framelist != NULL);

  /* Add the incoming list of framelist to queue of framelist to tx */

  for (iob = framelist; iob != NULL; iob = framelist)
    {
      /* Remove the IOB from the queue */

      framelist     = iob->io_flink;
      iob->io_flink = NULL;

      ninfo("Queuing frame IOB %p\n", iob);
      memcpy(mac, pktmeta->pm_dest.pa_addr, CONFIG_PKTRADIO_ADDRLEN);
#if CONFIG_PKTRADIO_ADDRLEN == 1
      ninfo("MAC: %02x\n", mac[0]);

#elif CONFIG_PKTRADIO_ADDRLEN == 2
      ninfo("MAC: %02x:%02x\n", mac[0], mac[1]);

#elif CONFIG_PKTRADIO_ADDRLEN == 8
      ninfo("MAC: %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x\n",
            mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
#endif
      memcpy(mac, pktmeta->pm_src.pa_addr, CONFIG_PKTRADIO_ADDRLEN);
#if CONFIG_PKTRADIO_ADDRLEN == 1
      ninfo("MAC: %02x\n", mac[0]);

#elif CONFIG_PKTRADIO_ADDRLEN == 2
      ninfo("MAC: %02x:%02x\n", mac[0], mac[1]);

#elif CONFIG_PKTRADIO_ADDRLEN == 8
      ninfo("MAC: %02x:%02x:%02x:%02x:%02x:%02x:%02x:%02x\n",
            mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
#endif

      /* Add the MAC header */

      espnow_add_header(priv, pktmeta, iob);

      /* Add the IOB to the tail of the tx list */

      espnow_txtailadd(priv, iob);
    }

  /* Schedule the work on the worker thread. */

  if (work_available(&priv->work))
    {
      work_queue(LPBKWORK, &priv->work, espnow_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: espnow_properties
 *
 * Description:
 *   Different packet radios may have different properties.  If there are
 *   multiple packet radios, then those properties have to be queried at
 *   run time.  This information is provided to the 6LoWPAN network via the
 *   following structure.
 *
 * Input Parameters:
 *   netdev     - The network device to be queried
 *   properties - Location where radio properties will be returned.
 *
 * Returned Value:
 *   Zero (OK) returned on success; a negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int espnow_properties(FAR struct radio_driver_s *netdev,
                             FAR struct radiodev_properties_s *properties)
{
  DEBUGASSERT(netdev != NULL && properties != NULL);
  memset(properties, 0, sizeof(struct radiodev_properties_s));

  /* General */

  properties->sp_addrlen  = CONFIG_PKTRADIO_ADDRLEN; /* Length of an address */
  properties->sp_framelen = CONFIG_IOB_BUFSIZE;      /* Fixed frame length */

  /* Multicast address */

  properties->sp_mcast.nv_addrlen = CONFIG_PKTRADIO_ADDRLEN;
  memset(properties->sp_mcast.nv_addr, 0xee, RADIO_MAX_ADDRLEN);

  /* Broadcast address */

  properties->sp_bcast.nv_addrlen = CONFIG_PKTRADIO_ADDRLEN;
  memset(properties->sp_mcast.nv_addr, 0xff, RADIO_MAX_ADDRLEN);

#ifdef CONFIG_NET_STARPOINT
  /* Star hub node address */

  properties->sp_hubnode.nv_addrlen = 1;
  properties->sp_hubnode.nv_addr[0] = CONFIG_ESP32_ESPNOW_PKTRADIO_HUB_NODE;
#endif

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pktradio_espnow
 *
 * Description:
 *   Initialize and register the 6LoWPAN over espnow MAC network driver.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

int pktradio_espnow(void)
{
  FAR struct espnow_driver_s *priv;
  FAR struct radio_driver_s *radio;
  FAR struct net_driver_s *dev;

  ninfo("Initializing\n");

  /* Get the interface structure associated with this interface number. */

  priv = &g_espnow;

  /* Initialize the driver structure */

  memset(priv, 0, sizeof(struct espnow_driver_s));

  radio               = &priv->radio;
  dev                 = &radio->r_dev;
  dev->d_ifup         = espnow_ifup;          /* I/F up (new IP address) callback */
  dev->d_ifdown       = espnow_ifdown;        /* I/F down callback */
  dev->d_txavail      = espnow_txavail;       /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
  dev->d_addmac       = espnow_addmac;        /* Add multicast MAC address */
  dev->d_rmmac        = espnow_rmmac;         /* Remove multicast MAC address */
#endif
#ifdef CONFIG_NETDEV_IOCTL
  dev->d_ioctl        = espnow_ioctl;         /* Handle network IOCTL commands */
#endif
  dev->d_private      = priv;             /* Used to recover private state from dev */

  /* Set the network mask and MAC-based IP address */

  espnow_netmask(dev);
  espnow_addr(dev);
  espnow_addr2ip(dev);

  /* Initialize the Network frame-related callbacks */

  radio->r_get_mhrlen = espnow_get_mhrlen;    /* Get MAC header length */
  radio->r_req_data   = espnow_req_data;      /* Enqueue frame for transmission */
  radio->r_properties = espnow_properties;    /* Returns radio properties */

#ifdef CONFIG_NET_6LOWPAN
  /* Make sure the our single packet buffer is attached.
   * We must do this before registering the device since,
   *  once the device is registered, a packet may
   * be attempted to be forwarded and require the buffer.
   */

  priv->radio.r_dev.d_buf = priv->iobuffer.rb_buf;
#endif

  /* Register the loopabck device with the OS so that socket IOCTLs can
   * be performed.
   */

  netdev_register(&priv->radio.r_dev, NET_LL_PKTRADIO);

  /* Put the network in the UP state */

  dev->d_flags = IFF_UP;
  return espnow_ifup(&priv->radio.r_dev);
}

#endif /* CONFIG_ESPRESSIF_ESPNOW_PKTRADIO */
